# StructuralSectionZprofileBottomFlangeLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionZprofileBottomFlangeLength Property
ParameterTypeId Class See Also
---
"Bottom Flange Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionZprofileBottomFlangeLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionZprofileBottomFlangeLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionZprofileBottomFlangeLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace